src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКопии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторПостоянный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/КонфигурацияИнформационнойБазыСрезПоследних/КонфигурацияИнформационнойБазыСрезПоследних.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонфигурацияИнформационнойБазыСрезПоследних</name>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимРаботыКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделениеПоОбластям</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Информация.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Объект.Ссылка);
	МетаданныеКонфигурации.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Объект.Ссылка);
	ФункциональныеОпции.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Объект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Конфигурация КАК Конфигурация,
	|	РежимРаботыКонфигурации КАК РежимРаботыКонфигурации,
	|	РазделениеПоОбластям КАК РазделениеПоОбластям
	|ИЗ
	|	РегистрСведений.КонфигурацияИнформационнойБазыСрезПоследних
	|ГДЕ
	|	ИнформационнаяБаза = &ИнформационнаяБаза
	|";
	Запрос.УстановитьПараметр("ИнформационнаяБаза", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект.Конфигурация = Выборка.Конфигурация;
		ЭтотОбъект.РежимРаботыКонфигурации = Выборка.РежимРаботыКонфигурации;
		ЭтотОбъект.РазделениеПоОбластям = Выборка.РазделениеПоОбластям;
		
	КонецЦикла;
	
КонецПроцедуры
